tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# Prerequisites

brew "mas"
cask "java"
cask "xquartz"

# GNU tools

brew "coreutils"
brew "gnu-sed"
brew "openssh"

# Files

brew "syncthing", restart_service: true
mas "OneDrive", id: 823766827

# Reading

mas "Notability", id: 360593530
cask "netnewswire"

# Communication

mas "WhatsApp", id: 1147396723
mas "Airmail", id: 918858936
mas "Slack", id: 803453959
mas "Telegram", id: 747648890

# Security

brew "yubikey-agent"
mas "Tailscale", id: 1475387142
cask "1password"
cask "keybase"
cask "secretive"

# Internet

cask "firefox"

# Development

brew "postgresql", restart_service: true
brew "redis", restart_service: true
cask "docker"
cask "fork"
cask "iterm2"
cask "visual-studio-code"

# Cloud

brew "aws-iam-authenticator"
brew "awscli"
brew "terraform"

# Media

cask "spotify"
cask "vlc"

# Utilities

cask "alfred"
cask "spectacle"
mas "The Unarchiver", id: 425424353

# Fonts

cask "font-fira-code"
cask "font-iosevka-slab"
cask "font-iosevka"
