tap "homebrew/bundle"

brew "bash"
brew "diff-so-fancy"
brew "direnv"
brew "gh"
brew "git"
brew "go"
brew "gpg"
brew "graphviz"
brew "htop"
brew "jq"
brew "lua"
brew "node"
brew "pinentry"
brew "protobuf"
brew "ruby"
brew "telnet"
brew "tmux"
brew "tree"
brew "typescript"
brew "wget"
brew "yarn"
brew "zsh"
