tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "xo/xo"

# Prerequisites

brew "mas"
brew "duti"

# GNU tools

brew "coreutils"
brew "gnu-sed"
brew "openssh"

# Files

brew "syncthing", restart_service: true

# Communication

mas "Airmail", id: 918858936

# Security

brew "age"
brew "gnupg"
brew "sops"

cask "1password-beta"
cask "1password-cli-beta"
cask "protonvpn"

mas "Tailscale", id: 1475387142

# Internet

brew "curl"
brew "wget"
cask "firefox"

# Notes

mas "Craft", id: 1487937127

# Development

brew "bash"
brew "zsh"
brew "direnv"
cask "iterm2"

brew "postgresql@14", restart_service: true
brew "redis", restart_service: true
brew "sqlite"
brew "xo/xo/usql"

brew "git"
brew "diff-so-fancy"
brew "gh"
cask "fork"

brew "go"
brew "lua"
brew "node"
brew "protobuf"
brew "ruby"
brew "typescript"
brew "yarn"

brew "entr"
brew "jq"
brew "tmux"

cask "docker"
cask "visual-studio-code"

# Cloud

brew "awscli"

# Media

brew "ffmpeg"
brew "imagemagick"
cask "spotify"
cask "vlc"

# Utilities

brew "graphviz"
brew "htop"
brew "mtr"
brew "speedtest-cli"
brew "tldr"
brew "tree"

cask "alfred"
cask "bartender"
cask "grandperspective"
cask "istat-menus"
cask "rectangle"

mas "The Unarchiver", id: 425424353

# Fonts

cask "font-iosevka"

# Xcode always takes a long time to install, so it's last

mas "Xcode", id: 497799835
